{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_state": false, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "batch_input_shape": [null, 60, 1], "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "name": "lstm_21", "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "dtype": "float32", "recurrent_regularizer": null, "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_21", "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "LSTM", "config": {"return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "name": "lstm_22", "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "recurrent_regularizer": null, "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_22", "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "LSTM", "config": {"return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "name": "lstm_23", "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": true, "recurrent_regularizer": null, "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_23", "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "LSTM", "config": {"return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "name": "lstm_24", "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "recurrent_regularizer": null, "stateful": false, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_24", "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "use_bias": true, "activation": "linear", "name": "dense_6"}}], "keras_version": "2.1.2"}